In [1]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])


df = df.set_index([df.index, 'Name'])
df.index.names = ['Location', 'Name']
df = df.append(pd.Series(data={'Cost': 3.00, 'Item Purchased': 'Kitty Food'}, name=('Store 2', 'Kevyn')))
df

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0
         Kevyn     Kitty Food   3.0

In [2]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])

In [3]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [7]:
car_1 = pd.Series({'Model': 'Golf',
                  'Power': 2.0,
                  'Color': 'White',
                  'Price': 22.00,
                  'Top Speed km/h': 180})
car_2 = pd.Series({'Model': 'Punto',
                  'Power': 1.0,
                  'Color': 'Black',
                  'Price': 10.00,
                  'Top Speed km/h': 140})
car_3 = pd.Series({'Model': 'Mercedez Benz',
                  'Power': 4.0,
                  'Color': 'White',
                  'Price': 32.00,
                  'Top Speed km/h': 240})

In [8]:
df = pd.DataFrame([car_1,car_2,car_3])

In [9]:
df

           Model  Power  Color  Price  Top Speed km/h
0           Golf    2.0  White   22.0             180
1          Punto    1.0  Black   10.0             140
2  Mercedez Benz    4.0  White   32.0             240

In [12]:
df.fillna?